АлогистикТест2/src/Documents/алк_ВзаиморасчетыПоЗаказам/алк_ВзаиморасчетыПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_ВзаиморасчетыПоЗаказам</name>
  <registerRecords>AccumulationRegister.алк_Взаиморасчеты</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

АлогистикТест2/src/Documents/алк_ВзаиморасчетыПоЗаказам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ИнициализацияДаных
	
	// Инициализирует таблицы значений, содержащие данные табличных частей документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаВзаиморасчетыПоЗаказам, СтруктураДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ВзаиморасчетыПоЗаказам.Сумма,
		|	алк_ВзаиморасчетыПоЗаказам.Дата КАК Период,
		|	алк_ВзаиморасчетыПоЗаказам.Заказ,
		|	алк_ВзаиморасчетыПоЗаказам.Объем,
		|	алк_ВзаиморасчетыПоЗаказам.СтоимостьПеревозки,
		|	&ВидДвижения
		|ИЗ
		|	Документ.алк_ВзаиморасчетыПоЗаказам КАК алк_ВзаиморасчетыПоЗаказам
		|ГДЕ
		|	алк_ВзаиморасчетыПоЗаказам.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаВзаиморасчетыПоЗаказам);
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаВзаиморасчеты", МассивРезультатов[0].Выгрузить());

	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли
